#-*- mode: org -*-
#+STARTUP: heads

#+TITLE=Specific LaTeX configures

** TODO Add hooks
#+BEGIN_SRC elisp
  (defun brust-LaTeX-mode-hook nil
    (turn-on-cdlatex)
    ;; (LaTeX-math-mode) ;; I use cdlatex insted
    (turn-on-reftex)
    (flyspell-mode 1)
    (outline-minor-mode 1)
    (flyspell-ignore-tex) ;; Now ispell knows it is working on a LaTeX file.
    ;; (TeX-interactive-mode 1)
    (yas-minor-mode -1)

    ;; mic-parent futures
    (paren-toggle-matching-paired-delimiter 1)
    (paren-toggle-matching-quoted-paren 1)
    (electric-pair-local-mode 1)
    (bratex-config)
    ;; (add-hook 'TeX-update-style-hook #'rainbow-delimiters-mode-enable)
    (setq TeX-clean-confirm nil
          ;; LaTeX-electric-left-right-brace t
          ;; LaTeX-clean-intermediate-suffixes (delete "\\.synctex\\.gz"  LaTeX-clean-intermediate-suffixes)
          LaTeX-clean-intermediate-suffixes
          (append LaTeX-clean-intermediate-suffixes
                  (list
                   "-blx"
                   "\\.fdb_latexmk"
                   "\\.run\\.xml"
                   "\\.aux.bak"
                   "\\.fls")))

    (LaTeX-mode-hook-company-setup)
    (my-LaTeX-mode-chords))

  ;; (imenu-add-menubar-index)
  ;; (TeX-fold-mode) ;; fold LaTeX macros

  (add-hook 'LaTeX-mode-hook #'brust-LaTeX-mode-hook t)

  ;; ::TODO Mirà que conecta el customize-map-.... de outline. 

  ;; (add-hook 'LaTeX-mode-hook '(LaTeX-add-environments 
                               ;;;;;;;;;;;;;;;; Add it via cdlatex ;;;;;;;;;;;;;;;;
  ;;                              '("axiom"       LaTeX-env-label)
  ;;                              '("theorem"     LaTeX-env-label)
  ;;                              '("definition"  LaTeX-env-label)
  ;;                              '("remark"      LaTeX-env-label)
  ;;                              '("proposition" LaTeX-env-label)
  ;;                              '("lemma"       LaTeX-env-label)
  ;;                              '("notation"    LaTeX-env-label)
  ;;                              '("corollary"   LaTeX-env-label)
  ;;                              '("tikzcd"      LaTeX-env-label)
  ;;                              '("tikzpicture" LaTeX-env-label)
  ;;                              '("frame"       LaTeX-env-label)
  ;;                              '("block"       LaTeX-env-label)) t)

#+END_SRC

#+RESULTS:
| preview-mode-setup | er/add-latex-mode-expansions | aggressive-indent-mode | brust-LaTeX-mode-hook |


** To get a full featured `LaTeX-section' command
#+BEGIN_SRC elisp
  (setq LaTeX-section-hook '(;; LaTeX-section-heading  
                             LaTeX-section-title
                             ;; LaTeX-section-toc
                             LaTeX-section-section
                             LaTeX-section-label))

  (setq LaTeX-section-label 
        '(("part" . "part:")
          ("chapter" . "chap:")
          ("section" . "sec:")
          ("subsection" . "ssec:")
          ("subsubsection" . "sssec:")))

#+END_SRC

#+RESULTS:
: ((part . part:) (chapter . chap:) (section . sec:) (subsection . ssec:) (subsubsection . sssec:))

*** Settings
#+BEGIN_SRC elisp
  (setq reftex-plug-into-AUCTeX t ;; To integrate RefTeX with AUCTeX
        reftex-allow-automatic-rescan t
        reftex-enable-partial-scans t
        reftex-save-parse-info t
        reftex-use-multiple-selection-buffers t
        ;; reftex-bibpath-environment-variables  '("~/Articoli/BibInput/")
        ;; reftex-file-extensions '(("nw" "tex" ".tex" ".ltx") ("bib" ".bib"))
        ;; reftex-default-bibliography '("~/Dropbox/bibliography/my.bib"
        ;;                              "~/Dropbox/bibliography/zotero-bibl.bib")

        ;; When prompt macro is nil, reftex-ref use macro defined at reftex-label-alist.
        ;; reftex-ref-style-alist '(("Default" t (("\\ref" 13) ("\\pageref" 112))))
        reftex-ref-macro-prompt nil

        reftex-toc-max-level 3
        reftex-auto-recenter-toc t
        ;; reftex-toc-auto-recenter-timer 1
        ;; reftex-toc-include-context t
        reftex-toc-confirm-promotion nil
        reftex-toc-follow-mode nil
        ;; reftex-cite-prompt-optional-args nil
        ;; reftex-cite-cleanup-optional-args t
        reftex-guess-label-type nil
        reftex-ref-style-default-list (quote ("Cleveref"))

        ;; So that RefTeX also recognizes \addbibresource. Note that you
        ;; can't use $HOME in path for \addbibresource but "~".
        ;; reftex-bibliography-commands '("bibliography" "nobibliography" "addbibresource")
        ;; reftex-refstyle "\\Cref" ;; set the defult refstyle...
        ;; reftex-ref-style-default-list (append (quote ("Cleveref")) reftex-ref-style-default-list)
        ;; reftex-cite-format
        ;;  '((?\C-m . "\\cite[]{%l}")
        ;;    (?f . "\\footcite[][]{%l}")
        ;;    (?t . "\\textcite[]{%l}")
        ;;    (?p . "\\parencite[]{%l}")
        ;;    (?o . "\\citepr[]{%l}")
        ;;    (?n . "\\nocite{%l}"))
        )
#+END_SRC

#+RESULTS:
| Cleveref |

*** Label list 
    The numbers in both lists are *toc* levels, negative does not show the "section" number.
#+BEGIN_SRC elisp
  (setq reftex-label-alist
        ;; reftex-label-alist '(AMSTeX)
        '(("axiom"         ?a "axm:"   "~\\cref{%s}" t   ("axiom"   "axm.")        )
          ("theorem"       ?t "thr:"   "~\\cref{%s}" t   ("theorem" "thr.")      -4)
          ("definition"    ?d "def:"   "~\\cref{%s}" t   ("definition" "def.")   -4)
          ("remark"        ?r "rmk:"   "~\\cref{%s}" t   ("remark" "rmk.")       -6)
          ("proposition"   ?p "prop:"  "~\\cref{%s}" t   ("proposition" "prop.") -5)
          ("lemma"         ?l "lem:"   "~\\cref{%s}" t   ("lemma" "lem.")        -5)
          ("notation"      ?n "not:"   "~\\cref{%s}" t   ("notation" "not.")     -6)
          ("corollary"     ?c "coro:"  "~\\cref{%s}" t   ("corollary" "coro.")   -6)))

  (setq reftex-section-levels
        '(("part" . 0)
          ("chapter" . 0)
          ("section" . 1)
          ("paragraph" . 2)
          ("beamersec" . -2)
          ("subsection" . 2)
          ("beamersubsec" . -3)
          ("subsubsection" . 3)
          ("beamersubsubsec" . -4)
          ("subparagraph" . 4)
          ("frametitle" . 7)
          ("addchap" . -1)
          ("addsec" . -2)))
#+END_SRC

#+RESULTS:
: ((part . 0) (chapter . 1) (section . 2) (paragraph . -3) (beamersec . -2) (subsection . -3) (beamersubsec . -3) (subsubsection . 4) (beamersubsubsec . -4) (subparagraph . 6) (frametitle . 7) (addchap . -1) (addsec . -2))

**** command-alist
    I delete the ones I do not want. In this way I keep the defaul list updated.
    Because the =setq=, the following =mapc= can not be done with a =cl-loop= 
#+BEGIN_SRC elisp
  (mapc (lambda (-key)
          (setq-default cdlatex-command-alist-default
                        (brust-list-delete-by-car -key cdlatex-command-alist-default)))
        '("pref"
          "ct"
          "cte"
          "cite{"
          "equ"
          "eqn"
          "alit"
          "alit*"
          "xal"
          "xal*"
          "xxa"
          "xxa*"
          "mul"
          "mul*"
          "gat"
          "gat*"
          "fla"
          "fla*"
          "fg"
          "sn"
          "ss"
          "sss"
          "ssp"
          "closed"
          "caseeq"
          "intl"
          "suml"
          "nonum"
          "qq"
          "qqq"))
#+END_SRC

#+RESULTS:
| pref | ct | cte | cite{ | equ | eqn | alit | alit* | xal | xal* | xxa | xxa* | mul | mul* | gat | gat* | fla | fla* | fg | sn | ss | sss | ssp | closed | caseeq | intl | suml | nonum | qq | qqq |


** Modify keys ='=

#+BEGIN_SRC elisp
(setq cdlatex-math-modify-alist

      '(
        ;; 0. key:      The character that is the key for a the accent.
        ;; 1. mathcmd:  The LaTeX command associated with the accent in math mode
        ;; 2. textcmd:  The LaTeX command associated with the accent in text mode
        ;; 3. type:     t   if command with argument (e.g. \\tilde{a}).
        ;;              nil if style (e.g. {\\cal a}).
        ;; 4. rmdot:    t   if the dot on i and j has to be removed.
        ;; 5. it        t   if italic correction is required."
        ( ?\.   "\\dot"               nil        t   t   nil )
        ( ?\:   "\\ddot"              nil        t   t   nil )
        ( ?\~   "\\tilde"             nil        t   t   nil )
        ( ?^    "\\hat"               nil        t   t   nil )
        ( ?\-   "\\bar"               nil        t   t   nil )
        ( ?\_   "\\underline"         nil        t   nil nil )
        ( ?\{   "\\overbrace"         nil        t   nil nil )
        ( ?\}   "\\underbrace"        nil        t   nil nil )
        ( ?\>   "\\vec"               nil        t   t   nil )
        ( ?/    "\\grave"             nil        t   t   nil )
        ( ?\\   "\\acute"             nil        t   t   nil )
        ( ?a    "\\fcat"              nil        t   nil nil )
        ( ?b    "\\mathbf"            "\\textbf" t   nil nil )
        ( ?c    "\\mathcal"           nil        t   nil nil )
        ( ?d    "\\mathbb"            "\\textbb" t   nil nil )
        ( ?e    "\\mathem"            "\\emph"   t   nil nil )
        ( ?f    "\\mathfrak"          "\\textsf" t   nil nil )
        ( ?i    "\\im"                "\\textit" t   nil nil )
        ( ?l    nil                   "\\textsl" t   nil nil )
        ( ?m    "\\mbox"              nil        t   nil nil )
        ( ?o    "\\op"                nil        t   nil nil )
        ( ?q    "\\funct"             nil        t   nil nil )
        ( ?r    "\\mathscr"           nil        t   nil nil )
        ;; ( ?r    "\\mathrm"            "\\textrm" t   nil nil )
        ( ?s    "\\s"                 nil        t   nil nil )
        ( ?t    "\\overline"          nil        t   nil nil )
        ( ?u    "\\breve"             nil        t   t   nil )
        ( ?v    "\\check"             nil        t   t   nil )
        ( ?y    "\\mathtt"            "\\texttt" t   nil nil )
        ( ?E    "\\mathem"            "\\emph"   t   nil nil )
        ( ?H    "\\widehat"           nil        t   t   nil )
        ( ?I    "\\mathit"            "\\textit" t   nil nil )
        ( ?N    "\\widetilde"         nil        t   t   nil )
        ( ?T    "\\overline"          nil        t   nil nil )
        ( ?0    "\\textstyle"         nil        nil nil nil )
        ( ?1    "\\displaystyle"      nil        nil nil nil )
        ( ?2    "\\scriptstyle"       nil        nil nil nil )
        ( ?3    "\\scriptscriptstyle" nil        nil nil nil )))

#+END_SRC

#+RESULTS:
|  46 | \dot               | nil     | t   | t   | nil |
|  58 | \ddot              | nil     | t   | t   | nil |
| 126 | \tilde             | nil     | t   | t   | nil |
|  94 | \hat               | nil     | t   | t   | nil |
|  45 | \bar               | nil     | t   | t   | nil |
|  95 | \underline         | nil     | t   | nil | nil |
| 123 | \overbrace         | nil     | t   | nil | nil |
| 125 | \underbrace        | nil     | t   | nil | nil |
|  62 | \vec               | nil     | t   | t   | nil |
|  47 | \grave             | nil     | t   | t   | nil |
|  92 | \acute             | nil     | t   | t   | nil |
|  97 | \fcat              | nil     | t   | nil | nil |
|  98 | \mathbf            | \textbf | t   | nil | nil |
|  99 | \mathcal           | nil     | t   | nil | nil |
| 100 | \mathbb            | \textbb | t   | nil | nil |
| 101 | \mathem            | \emph   | t   | nil | nil |
| 102 | \mathfrak          | \textsf | t   | nil | nil |
| 105 | \im                | \textit | t   | nil | nil |
| 108 | nil                | \textsl | t   | nil | nil |
| 109 | \mbox              | nil     | t   | nil | nil |
| 111 | \op                | nil     | t   | nil | nil |
| 113 | \funct             | nil     | t   | nil | nil |
| 114 | \mathscr           | nil     | t   | nil | nil |
| 115 | \s                 | nil     | t   | nil | nil |
| 116 | \overline          | nil     | t   | nil | nil |
| 117 | \breve             | nil     | t   | t   | nil |
| 118 | \check             | nil     | t   | t   | nil |
| 121 | \mathtt            | \texttt | t   | nil | nil |
|  69 | \mathem            | \emph   | t   | nil | nil |
|  72 | \widehat           | nil     | t   | t   | nil |
|  73 | \mathit            | \textit | t   | nil | nil |
|  78 | \widetilde         | nil     | t   | t   | nil |
|  84 | \overline          | nil     | t   | nil | nil |
|  48 | \textstyle         | nil     | nil | nil | nil |
|  49 | \displaystyle      | nil     | nil | nil | nil |
|  50 | \scriptstyle       | nil     | nil | nil | nil |
|  51 | \scriptscriptstyle | nil     | nil | nil | nil |

** Math symbol list =ñ=

#+BEGIN_SRC elisp
  (setq cdlatex-math-symbol-alist
        '(( ?c  ( "\\circ"          "\\comp"    "\\cos"))
          ( ?a  ( "\\alpha"         "\\aff"     ""))
          ( ?A  ( "\\Alpha"         "\\aleph"))
          ( ?b  ( "\\beta"))
          ( ?B  ( "\\Beta"))
          ( ?C  ( "\\lceil"         "\\rceil"     "\\arccos"))
          ( ?d  ( "\\delta"         "\\partial"))
          ( ?D  ( "\\Delta"         "\\nabla"))
          ( ?e  ( "\\varepsilon"    "\\epsilon"   "\\exp"))
          ( ?E  ( "\\exists"        ""            "\\ln"))
          ( ?f  ( "\\varphi"        "\\field"     "\\phi"))
          ( ?F  ( "\\Phi"                 ))
          ( ?g  ( "\\gamma"         "\\dim~"       "\\deg~"))
          ( ?G  ( "\\Gamma"))
          ( ?h  ( "\\eta"           "\\hbar"))
          ( ?H  ( ""                 ))
          ( ?i  ( "\\in"            "\\inte"       "i=1,\\dots,n"))
          ( ?I  ( "\\Im"))
          ( ?j  ( "\\iota"          "j=1,\\dots,n" "j=0,\\dots,n"))
          ( ?J  ( ""                 ))
          ( ?k  ( "\\kappa"          ))
          ( ?K  ( ""                 ))
          ( ?l  ( "\\lambda"        ""             "\\ln"))
          ( ?L  ( "\\Lambda"         ))
          ( ?m  ( "\\mu"            "\\module"  "\\matx"))
          ( ?M  ( ""                "\\matx" ))
          ( ?n  ( "\\nu"            "\\nat"     "\\ln"))
          ( ?N  ( ""))
          ( ?o  ( "\\omega"          ))
          ( ?O  ( "\\Omega"         "\\mho"))
          ( ?p  ( "\\pi"            "\\proj"    "\\perp"))
          ( ?P  ( "\\Pi"))
          ( ?q  ( "\\theta"         "\\qch"     "\\vartheta"))
          ( ?Q  ( "\\Theta"         "\\rat"))
          ( ?r  ( "\\rho"           "\\reals"   "\\varrho"))
          ( ?R  ( ""                "\\Re"))
          ( ?s  ( "\\sigma"         "\\sch"     "\\set"))
          ( ?S  ( "\\Sigma"         ""          "\\arcsin"))
          ( ?t  ( "\\tau"           "\\set"     "\\tan"))
          ( ?T  ( ""                ""          "\\arctan"))
          ( ?u  ( "\\upsilon"        ))
          ( ?U  ( "\\Upsilon"        ))
          ( ?v  ( "\\vee"            ))
          ( ?V  ( "\\Phi"            ))
          ( ?w  ( "\\xi"             ))
          ( ?W  ( "\\Xi"             ))
          ( ?x  ( "\\chi"   "x_1,\\dots,x_n" "x_0,\\dots,x_n"          ))
          ( ?X  ( ""                 ))
          ( ?y  ( "\\psi"   "y_1,\\dots,y_m" "y_0,\\dots,y_m"          ))
          ( ?Y  ( "\\Psi"            ))
          ( ?z  ( "\\zeta"  "z_1,\\dots,z_k" "z_0,\\dots,z_k"        ))
          ( ?Z  ( "" ))
          ;; ( ?   ( "" ))
          ( ?0  ( "\\emptyset"       ))
          ( ?1  ( "^{-1}"           "^{*}"   "^{#}"))
          ( ?2  ( "\\clf"))
          ( ?3  ( "\\cls"))
          ( ?4  ( "\\clk"))
          ( ?5  ( "\\clpi"))
          ( ?6  ( "\\clb"))
          ( ?7  ( "\\not"           "\\neq"))
          ( ?8  ( "\\infty"          ))
          ( ?9  ( ""                 ))
          ( ?!  ( ""                 ))
          ( ?@  ( ""                 ))
          ( ?#  ( ""                 ))
          ( ?$  ( ""                 ))
          ( ?%  ( ""                 ))
          ( ?^  ( "\\uparrow"        ))
          ( ?&  ( "\\wedge"          ))
          ( ?\? ( ""                 ))
          ( ?_  ( "\\overset"       "\\underto"))
          ( ?:  ( "\\vdots"         "\\ddots"))
          ( ?,  ( "\\from"          "\\bullet"  ""))
          ( ?.  ( "\\dots"          "\\cdots"   "\\cdot"))
          ( ?-  ( "\\to"            "\\tohook"  "\\tofunct"))
          ( ?*  ( "\\otimes"        "\\cap"     "\\bigcap"))
          ( ?+  ( "\\times"         "\\cup"     "\\bigcup"))
          ( ?/  ( "\\not"           "\\neq"))
          ( ?|  ( "\\perp"          ""))
          ( ?º  ( "\\setminus"       ))
          ( ?\\ ( "\\setminus"       ))
          ( ?\" ( ""                 ))
          ( ?~  ( "\\approx"        "\\simeq"         "\\sim"))
          ( ?=  ( "\\cong"          "\\equiv"))
          ( ?\( ( "\\langle"         ))
          ( ?\) ( "\\rangle"         ))
          ( ?\[ ( ""     ""))
          ( ?\] ( ""    ""))
          ( ?ç  ( "\\subseteq"      "\\subset"))
          ( ?´  ( "\\supseteq"      "\\supset"))
          ( ?{  ( "\\{?\\}"))
          ( ?}  ( ""))
          ( ?<  ( "\\le"            "\\min"))
          ( ?>  ( "\\ge"            "\\max"))
          ( ?`  ( ""                 ))
          ( ?'  ( "\\prime"          ))))
#+END_SRC

#+RESULTS:
|  99 | (\circ \comp \cos)                  |
|  97 | (\alpha \aff )                      |
|  65 | (\Alpha \aleph)                     |
|  98 | (\beta)                             |
|  66 | (\Beta)                             |
|  67 | (\lceil \rceil \arccos)             |
| 100 | (\delta \partial)                   |
|  68 | (\Delta \nabla)                     |
| 101 | (\varepsilon \epsilon \exp)         |
|  69 | (\exists  \ln)                      |
| 102 | (\varphi \field \phi)               |
|  70 | (\Phi)                              |
| 103 | (\gamma \dim~ \deg~)                |
|  71 | (\Gamma)                            |
| 104 | (\eta \hbar)                        |
|  72 | ()                                  |
| 105 | (\in \inte i=1,\dots,n)             |
|  73 | (\Im)                               |
| 106 | (\iota j=1,\dots,n j=0,\dots,n)     |
|  74 | ()                                  |
| 107 | (\kappa)                            |
|  75 | ()                                  |
| 108 | (\lambda  \ln)                      |
|  76 | (\Lambda)                           |
| 109 | (\mu \module \matx)                 |
|  77 | ( \matx)                            |
| 110 | (\nu \nat \ln)                      |
|  78 | ()                                  |
| 111 | (\omega)                            |
|  79 | (\Omega \mho)                       |
| 112 | (\pi \proj \perp)                   |
|  80 | (\Pi)                               |
| 113 | (\theta \qch \vartheta)             |
|  81 | (\Theta \rat)                       |
| 114 | (\rho \reals \varrho)               |
|  82 | ( \Re)                              |
| 115 | (\sigma \sch \set)                  |
|  83 | (\Sigma  \arcsin)                   |
| 116 | (\tau \set \tan)                    |
|  84 | (  \arctan)                         |
| 117 | (\upsilon)                          |
|  85 | (\Upsilon)                          |
| 118 | (\vee)                              |
|  86 | (\Phi)                              |
| 119 | (\xi)                               |
|  87 | (\Xi)                               |
| 120 | (\chi x_1,\dots,x_n x_0,\dots,x_n)  |
|  88 | ()                                  |
| 121 | (\psi y_1,\dots,y_m y_0,\dots,y_m)  |
|  89 | (\Psi)                              |
| 122 | (\zeta z_1,\dots,z_k z_0,\dots,z_k) |
|  90 | ()                                  |
|  48 | (\emptyset)                         |
|  49 | (^{-1} ^{*} ^{#})                   |
|  50 | (\clf)                              |
|  51 | (\cls)                              |
|  52 | (\clk)                              |
|  53 | (\clpi)                             |
|  54 | (\clb)                              |
|  55 | (\not \neq)                         |
|  56 | (\infty)                            |
|  57 | ()                                  |
|  33 | ()                                  |
|  64 | ()                                  |
|  35 | ()                                  |
|  36 | ()                                  |
|  37 | ()                                  |
|  94 | (\uparrow)                          |
|  38 | (\wedge)                            |
|  63 | ()                                  |
|  95 | (\overset \underto)                 |
|  58 | (\vdots \ddots)                     |
|  44 | (\from \bullet )                    |
|  46 | (\dots \cdots \cdot)                |
|  45 | (\to \tohook \tofunct)              |
|  42 | (\otimes \cap \bigcap)              |
|  43 | (\times \cup \bigcup)               |
|  47 | (\not \neq)                         |
| 124 | (\perp )                            |
| 186 | (\setminus)                         |
|  92 | (\setminus)                         |
|  34 | ()                                  |
| 126 | (\approx \simeq \sim)               |
|  61 | (\cong \equiv)                      |
|  40 | (\langle)                           |
|  41 | (\rangle)                           |
|  91 | ( )                                 |
|  93 | ( )                                 |
| 231 | (\subseteq \subset)                 |
| 180 | (\supseteq \supset)                 |
| 123 | (\{?\})                             |
| 125 | ()                                  |
|  60 | (\le \min)                          |
|  62 | (\ge \max)                          |
|  96 | ()                                  |
|  39 | (\prime)                            |

